vips_ai = {
    # 视频相关的模型优化
    '54/4989-2',  # 香港大学 罗平
    '28/4556-1',  # 香港中文大学 余備
    '172/4863',  # 香港科技大学 广州 Yuzhe Ma
    '176/1445',  # 香港大学 Xiaojuan Qi
    '117/4819',  # 香港中文大学 陳启峰
    # 图片相关的模型优化
    '64/5666-6',  # 香港理工 Lei Zhang
    # 机器学习理论
    '82/6362-1',  # 香港科技大学 Qiang Yang
    'c/LeiChen0002',  # 香港科技大学 Lei CHEN
    '06/4171',  # 香港中文大学 James Cheng
    '50/2644-1',  # 清华大学 朱军
}
vips_app = {
    '07/9968',  # 香港科技大学 [沈劭劼]
    # 边缘计算+视频
    '01/267-1',  # 香港理工大学 Song Guo
    # 分布式机器学习理论
    '82/6362-1',  # 香港科技大学 Qiang Yang
    'c/LeiChen0002',  # 香港科技大学 Lei CHEN
    '06/4171',  # 香港中文大学 James Cheng
    # 交叉
    '165/784',  # 香港中文大学 Qi DOU
    # 多媒体
    'l/JiangchuanLiu',  # Simon Fraser University Jiangchuan (JC) LIU
    '97/6308-1',  # 清华大学 朱文武
    # 边缘计算
    '142/0351',  # 港中文 Fangxin Wang 21年刚招生
}
vips_other = {
    # 边缘计算+视频
    '01/267-1',  # 香港科技 Song Guo
    '99/4094',  # 清华 院士 张尧学
    '142/0351',  # 港中文 Fangxin Wang 21年刚招生
    '27/2403',  # 清华 Yunhao Liu
    '93/2334-8',  # 清华 Yong Li

    # 视频相关的模型优化
    '54/4989-2',  # 港大 罗平
    '91/6236-1',  # 港中文 Xiaogang Wang 但只招博后和RA
    '65/1792',  # 香港科技 屈华民
    'l/JiangchuanLiu',  # 香港科技 Jiangchuan (JC) LIU
    '117/4819',  # 香港科技 陳启峰
    '185/7848',  # 港大 Hengshuang Zhao
    'c/LeiChen0002',  # 香港科技 Lei Chen

    # 图片的模型优化
    '64/5666-6',  # 香港科技 Lei Zhang

    # 机器视觉/图传
    '27/2403', '59/5806-2',  # 清华
    # 清华大学深圳研究院
    '74/1552-1',  # 清深 江勇
    '95/6543',  # 清华 王智

    # 模型优化
    '28/10261-1', '43/5685-1',  # 上交
}
pure_sota = {  # 纯模型研究
    '24/8616', '176/4020', '00/5815-1', '166/2763', '61/5017', '06/10816', '119/0230',
    '01/5855', '127/0477', '79/3711', '14/6655', '24/4105-8', '97/8704-54', '46/5881', '17/1926',
    '33/4058', '158/1384', '53/520', '77/6697', '51/3185', '31/5649', '16/1278', '205/3991', '23/2089',
    '05/6300-2', '46/3391', '126/3420', '39/3695', '59/4859', '179/6089', '99/4522', '17/2703-1',
    '10/8359-1', '64/2916', '139/6983', '19/3230', 'c/LiChen21', '75/2339', '13/322', '00/5012',
    '10/239-2', '97/3742', '84/4965', 's/HTShen', '92/10934', '172/1282', '75/1030', '40/566',
    '45/7592', '09/1365-5', '92/2954', '75/1030', '45/7592', 'y/JianYang3', '69/4250', '40/566',
    '16/8313', '75/1281', 'v/AntonvandenHengel', '51/5804', '56/1673', '23/8653', '17/1152-5',
    'c/AmitKRoyChowdhury', '126/4457', '84/7019', '42/5677', '63/34', '79/1442-6', '55/957-8',
    '151/8848', '56/2053-1', '78/1123', '119/9269', '51/1815', '39/2152', '89/5820', '65/7804',
    '49/3441', 'w/KwanYeeKennethWong', '16/9879', '117/4770', '93/2671', '43/9044', '98/1737-2',
    '54/6827', '136/9389', '23/1818', '95/3056', '24/5818',
}
others = {
    # 视频质量检测
    '20/5353', 'b/ACBovik', '13/3788', '92/6630', '01/8056', '03/5833', '14/3737', '122/2673', '00/5012-1',
    # 纯ABR研究
    '93/347', '91/2346-1', '10/5630-1', '49/8116', '09/6350', '200/2255',
    # 通信研究
    '46/3359-1',
    # 可视化研究
    '49/6702',
    # 不相关
    '26/6037', '86/7615', 'm/SamuelMadden', 's/MichaelStonebraker', '27/6045', '41/1662-1', '84/3254-1', '78/1467-1',
    '11/5357-1', '218/7793', '10/2717', '75/7785',
    # 北大 数字视频编解码技术国家工程实验室
    '02/894', 's/JunSun12', '02/2683', '32/197', 'd/LingyuDuan',
    '38/2763',  # 清华 王生进 机器视觉机器人
    '06/2128',  # 孙立峰 清华大学计算机科学与技术系，视频传输
    '58/5750-1'  # 博士平均毕业时间》=6年
    '59/1007',  # 推荐系统
}
